// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.


Console.Write($"Введите число: ");
string number = (Console.ReadLine()!);
Console.Write($"Цифра = {number[1]}"); 